YooLiny520/wireless-flasher-stm32/src/web/web_server.cpp
document.getElementById('flashButton').addEventListener('click', async () => {
  try {
    const selectedFirmware = flashPackageSelect.value || 'active';
    const savedPackageId = selectedFirmware.startsWith('saved:') ? selectedFirmware.substring(6) : '';
    const response = await request('/api/flash/start', {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ savedPackageId })
    });
    statusLog.textContent = response.message;
    await refreshStatus();
  } catch (error) {
    statusLog.textContent = error.message;
  }
});

document.getElementById('cancelButton').addEventListener('click', async () => {
  try {
    const response = await request('/api/flash/cancel', { method: 'POST' });
    statusLog.textContent = response.message;
    await refreshStatus();
  } catch (error) {
    statusLog.textContent = error.message;
  }
});

document.getElementById('deleteButton').addEventListener('click', async () => {
  try {
    const response = await request('/api/package', { method: 'DELETE' });
    statusLog.textContent = response.message;
    progressBar.value = 0;
    await refreshInfo();
    await refreshStatus();
    await refreshPackages();
  } catch (error) {
    statusLog.textContent = error.message;
  }
});

savePackageButton.addEventListener('click', async () => {
  setSavedPackageLog('正在保存当前固件...');
  try {
    await refreshPackages();
    const requestedName = firmwareNameInput.value.trim();
    let replaceId = '';
    const duplicateOption = requestedName
      ? Array.from(savedPackageSelect.options).find(option => option.dataset.name === requestedName)
      : null;
    if (duplicateOption) {
      const replace = confirm(`已存在名为“${requestedName}”的固件。\n\n确定：替换已有固件\n取消：共存并自动添加序号`);
      if (replace) {
        replaceId = duplicateOption.value;
      }
    }
    const result = await request('/api/packages/save', {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ name: requestedName, replaceId })
    });
    setSavedPackageLog(`已保存: ${result.name || result.id}`);
    firmwareNameInput.value = '';
    await refreshPackages();
  } catch (error) {
    setSavedPackageLog(error.message);
  }
});

async function switchFlashFirmware(id) {
  statusLog.textContent = id ? '正在切换烧录固件...' : '正在切换到当前固件...';
  try {
    const result = await request('/api/packages/select', {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ id })
    });
    statusLog.textContent = id ? `已切换烧录固件: ${result.chip || '-'} ${formatBytes(result.size)}。` : '已切换到当前固件。';
    await refreshInfo();
    await refreshStatus();
    await refreshPackages();
  } catch (error) {
    statusLog.textContent = error.message;
  }
}

flashPackageSelect.addEventListener('change', async () => {
  const selectedFirmware = flashPackageSelect.value || 'active';
  const id = selectedFirmware.startsWith('saved:') ? selectedFirmware.substring(6) : '';
  await switchFlashFirmware(id);
});

deleteSavedPackageButton.addEventListener('click', async () => {
  const id = savedPackageSelect.value;
  if (!id) {
    setSavedPackageLog('请选择一个已保存固件。');
    return;
  }
  setSavedPackageLog('正在删除已保存固件...');
  try {
    const result = await request('/api/packages/delete', {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ id })
    });
    setSavedPackageLog(result.message || '已删除已保存固件');
    await refreshPackages();
  } catch (error) {
    setSavedPackageLog(error.message);
  }
});

refreshDeviceButton.addEventListener('click', async () => {
  await refreshInfo();
  await refreshStatus();
});

readChipButton.addEventListener('click', async () => {
  chipInfo.textContent = '正在通过 SWD 读取芯片信息...';
  try {
    const info = await request('/api/target/chip-info', { method: 'POST' });
    chipInfo.textContent =
      `芯片: ${info.chipName || '-'}\n` +
      `DPIDR: 0x${Number(info.dpidr || 0).toString(16).toUpperCase()}\n` +
      `DBGMCU_IDCODE: 0x${Number(info.dbgmcuIdcode || 0).toString(16).toUpperCase()}\n` +
      `CHIP_ID: 0x${Number(info.chipId || 0).toString(16).toUpperCase()}\n` +
      `${info.lineSample || ''}`;
  } catch (error) {
    chipInfo.textContent = error.message;
  }
});

refreshInfo();
refreshStatus();
refreshPackages();
updateFlashControls();
setInterval(refreshStatus, 1000);
setInterval(refreshInfo, 5000);
setInterval(refreshPackages, 5000);
)JS";
}

AppWebServer::AppWebServer(AccessPointManager &apManager,
                           PackageStore &packageStore,
                           FlashManager &flashManager,
                           TargetControl &targetControl,
                           Stm32SwdDebug &swdDebug,
                           Stm32F1Flash &stm32F1Flash)
    : apManager_(apManager),
      packageStore_(packageStore),
      flashManager_(flashManager),
      targetControl_(targetControl),
      swdDebug_(swdDebug),
      stm32F1Flash_(stm32F1Flash) {}

void AppWebServer::begin() {
  server_ = new WebServer(80);
  configureRoutes();
  server_->begin();
}

void AppWebServer::handleClient() {
  if (server_) {
    server_->handleClient();
  }
}

void AppWebServer::configureRoutes() {
  server_->on("/", HTTP_GET, [this]() { handleIndex(); });
  server_->on("/app.js", HTTP_GET, [this]() {
    server_->sendHeader("Cache-Control", "no-store");
    server_->send_P(200, "application/javascript", kEmbeddedAppJs);
  });

  server_->on("/api/info", HTTP_GET, [this]() { handleInfo(); });
  server_->on("/api/status", HTTP_GET, [this]() { handleStatus(); });
  server_->on("/api/flash/start", HTTP_POST, [this]() { handleFlashStart(); });
  server_->on("/api/flash/cancel", HTTP_POST, [this]() { handleFlashCancel(); });
  server_->on("/api/package", HTTP_DELETE, [this]() { handleDeletePackage(); });
  server_->on(
      "/api/upload", HTTP_POST,
      [this]() {
        JsonDocument doc;
        doc["ok"] = true;
        doc["message"] = "File received";
        String payload;
        serializeJson(doc, payload);
        sendJson(200, payload);
      },
      [this]() {
        HTTPUpload &upload = server_->upload();
        String error;

