YooLiny520/wireless-flasher-stm32/src/web/web_server.cpp
        if (upload.status == UPLOAD_FILE_START) {
          if (!isHexUploadName(upload.filename)) {
            sendError(400, "Only Intel HEX files are supported");
            return;
          }
        }

        if (upload.status == UPLOAD_FILE_WRITE) {
          const bool reset = upload.totalSize == 0;
          if (!packageStore_.appendIntelHexChunk(upload.buf, upload.currentSize, reset, error)) {
            sendError(400, error);
          }
        }

        if (upload.status == UPLOAD_FILE_END) {
          return;
        }

        if (upload.status == UPLOAD_FILE_ABORTED) {
          return;
        }
      });
  server_->on("/api/upload/hex/finalize", HTTP_POST, [this]() { handleHexUploadFinalize(); });
  server_->on("/api/packages", HTTP_GET, [this]() { handlePackages(); });
  server_->on("/api/packages/save", HTTP_POST, [this]() { handleSavePackage(); });
  server_->on("/api/packages/select", HTTP_POST, [this]() { handleSelectPackage(); });
  server_->on("/api/packages/delete", HTTP_POST, [this]() { handleDeleteSavedPackage(); });
  server_->on("/api/target/chip-info", HTTP_POST, [this]() { handleChipInfo(); });
}

void AppWebServer::handleIndex() {
  server_->sendHeader("Cache-Control", "no-store");
  server_->setContentLength(CONTENT_LENGTH_UNKNOWN);
  server_->send(200, "text/html; charset=utf-8", "");
  server_->sendContent_P(kEmbeddedIndexHtml);
  server_->sendContent("    <script>\n");
  server_->sendContent_P(kEmbeddedAppJs);
  server_->sendContent("\n    </script>\n");
  server_->sendContent_P(kEmbeddedIndexHtmlSuffix);
}

void AppWebServer::handleInfo() {
  JsonDocument doc;
  FlashStatus status = flashManager_.status();
  doc["name"] = "Exlink STM32 Wireless Flasher";
  doc["ssid"] = apManager_.ssid();
  doc["ip"] = apManager_.ipAddress();
  doc["passwordRequired"] = apManager_.hasPassword();
  doc["packageReady"] = status.packageReady;
  doc["swdIoPin"] = AppConfig::kSwdIoPin;
  doc["swdClockPin"] = AppConfig::kSwdClockPin;
  doc["swdResetPin"] = AppConfig::kSwdResetPin;
  doc["recommendedWiring"] = AppConfig::kRecommendedSwdWiringSummary;
  doc["targetChip"] = status.targetChip;
  doc["targetAddress"] = status.targetAddress;
  doc["firmwareCrc32"] = status.firmwareCrc32;
  doc["totalBytes"] = status.totalBytes;
  doc["storageTotalBytes"] = packageStore_.totalBytes();
  doc["storageUsedBytes"] = packageStore_.usedBytes();
  doc["storageFreeBytes"] = packageStore_.freeBytes();
  doc["maxFirmwareSize"] = AppConfig::kMaxFirmwareSize;
  doc["maxHexUploadSize"] = AppConfig::kMaxHexUploadSize;
  doc["state"] = status.stateLabel;
  doc["message"] = status.message;
  doc["log"] = status.log;

  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleStatus() {
  JsonDocument doc;
  FlashStatus status = flashManager_.status();
  doc["state"] = status.stateLabel;
  doc["message"] = status.message;
  doc["log"] = status.log;
  doc["targetChip"] = status.targetChip;
  doc["detectedChip"] = status.detectedChip;
  doc["targetAddress"] = status.targetAddress;
  doc["firmwareCrc32"] = status.firmwareCrc32;
  doc["bytesWritten"] = status.bytesWritten;
  doc["totalBytes"] = status.totalBytes;
  doc["packageReady"] = status.packageReady;

  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleHexUploadFinalize() {
  size_t hexSize = 0;
  if (LittleFS.exists(AppConfig::kHexTempPath)) {
    File hexFile = LittleFS.open(AppConfig::kHexTempPath, FILE_READ);
    if (hexFile) {
      hexSize = hexFile.size();
      hexFile.close();
    }
  }
  String error;
  if (!packageStore_.finalizeIntelHexPackage(error)) {
    sendError(400, error);
    return;
  }
  if (!flashManager_.setPackageReady(error)) {
    sendError(400, error);
    return;
  }

  FlashStatus status = flashManager_.status();
  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = "Intel HEX converted successfully";
  doc["hexSize"] = hexSize;
  doc["freeBytes"] = packageStore_.freeBytes();
  doc["usedBytes"] = packageStore_.usedBytes();
  doc["totalBytes"] = packageStore_.totalBytes();
  doc["chip"] = status.targetChip;
  doc["address"] = status.targetAddress;
  doc["size"] = status.totalBytes;
  doc["crc32"] = status.firmwareCrc32;
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleChipInfo() {
  FlashStatus status = flashManager_.status();
  if (FlashManager::isBusyState(status.state)) {
    sendError(409, "Flash job is busy");
    return;
  }

  String error;
  if (!targetControl_.prepareForSwd(error)) {
    sendError(500, "SWD prepare failed: " + error);
    return;
  }

  String lineSample;
  swdDebug_.sampleLineLevels(lineSample);

  if (!swdDebug_.connect(error)) {
    sendError(500, "SWD connect failed: " + error);
    return;
  }

  uint32_t dpId = 0;
  if (!swdDebug_.readDebugPortId(dpId, error)) {
    sendError(500, "SWD DPIDR read failed: " + error);
    return;
  }

  if (!swdDebug_.halt(error)) {
    sendError(500, "SWD halt failed: " + error);
    return;
  }

  uint32_t dbgmcuIdcode = 0;
  if (!stm32F1Flash_.readChipId(dbgmcuIdcode, error)) {
    sendError(500, "SWD chip ID read failed: " + error);
    return;
  }

  const uint32_t chipId = dbgmcuIdcode & 0x0FFFU;
  flashManager_.setDetectedChip(chipId);

  JsonDocument doc;
  doc["ok"] = true;
  doc["dpidr"] = dpId;
  doc["dbgmcuIdcode"] = dbgmcuIdcode;
  doc["chipId"] = chipId;
  doc["chipName"] = chipNameFromId(chipId);
  doc["lineSample"] = lineSample;
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handlePackages() {
  JsonDocument doc;
  doc["ok"] = true;
  doc["storageTotalBytes"] = packageStore_.totalBytes();
  doc["storageUsedBytes"] = packageStore_.usedBytes();
  doc["storageFreeBytes"] = packageStore_.freeBytes();
  doc["maxFirmwareSize"] = AppConfig::kMaxFirmwareSize;
  doc["maxHexUploadSize"] = AppConfig::kMaxHexUploadSize;
  String error;
  doc["selectedId"] = packageStore_.selectedSavedPackageId(error);
  if (!error.isEmpty()) {
    sendError(400, error);
    return;
  }
  JsonArray packages = doc["packages"].to<JsonArray>();
  if (!packageStore_.listSavedPackages(packages, error)) {
    sendError(400, error);
    return;
  }
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleSavePackage() {
  FlashStatus status = flashManager_.status();
  if (FlashManager::isBusyState(status.state)) {
    sendError(409, "Flash job is busy");
    return;
  }

  String name;
  String replaceId;
  if (server_->hasArg("plain")) {
    JsonDocument request;
    if (deserializeJson(request, server_->arg("plain")) == DeserializationError::Ok) {
      name = request["name"] | "";
      replaceId = request["replaceId"] | "";
    }
  }

  String error;
  SavedPackageInfo info;
  if (!packageStore_.saveActivePackage(name, info, error, replaceId)) {
    sendError(400, error);
    return;
  }

  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = "Firmware saved";
  doc["id"] = info.id;
  doc["name"] = info.name;
  doc["chip"] = info.chip;
  doc["address"] = info.address;
  doc["size"] = info.size;
  doc["crc32"] = info.crc32;
  doc["storageFreeBytes"] = packageStore_.freeBytes();
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

