YooLiny520/wireless-flasher-stm32/src/web/web_server.cpp
void AppWebServer::handleSelectPackage() {
  FlashStatus status = flashManager_.status();
  if (FlashManager::isBusyState(status.state)) {
    sendError(409, "Flash job is busy");
    return;
  }

  JsonDocument request;
  if (!server_->hasArg("plain") || deserializeJson(request, server_->arg("plain")) != DeserializationError::Ok) {
    sendError(400, "Saved package id is required");
    return;
  }
  String id = request["id"] | "";

  String error;
  if (id.isEmpty()) {
    if (!packageStore_.clearSelectedSavedPackage(error)) {
      sendError(400, error);
      return;
    }
    JsonDocument doc;
    doc["ok"] = true;
    doc["message"] = "Active firmware selected";
    String payload;
    serializeJson(doc, payload);
    sendJson(200, payload);
    return;
  }

  if (!packageStore_.restoreSavedPackage(id, error)) {
    sendError(400, error);
    return;
  }
  if (!flashManager_.setPackageReady(error)) {
    sendError(400, error);
    return;
  }

  status = flashManager_.status();
  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = "Saved firmware selected";
  doc["chip"] = status.targetChip;
  doc["address"] = status.targetAddress;
  doc["size"] = status.totalBytes;
  doc["crc32"] = status.firmwareCrc32;
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleDeleteSavedPackage() {
  FlashStatus status = flashManager_.status();
  if (FlashManager::isBusyState(status.state)) {
    sendError(409, "Flash job is busy");
    return;
  }

  JsonDocument request;
  if (!server_->hasArg("plain") || deserializeJson(request, server_->arg("plain")) != DeserializationError::Ok) {
    sendError(400, "Saved package id is required");
    return;
  }
  String id = request["id"] | "";

  String error;
  const bool wasSelected = packageStore_.selectedSavedPackageId(error) == id;
  if (!error.isEmpty()) {
    sendError(400, error);
    return;
  }
  if (!packageStore_.removeSavedPackage(id, error)) {
    sendError(400, error);
    return;
  }
  if (wasSelected) {
    flashManager_.clearPackageState();
  }

  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = "Saved firmware deleted";
  doc["storageFreeBytes"] = packageStore_.freeBytes();
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleFlashStart() {
  String error;
  String savedPackageId;
  if (server_->hasArg("plain")) {
    JsonDocument request;
    if (deserializeJson(request, server_->arg("plain")) == DeserializationError::Ok) {
      savedPackageId = request["savedPackageId"] | "";
    }
  }

  if (!savedPackageId.isEmpty()) {
    FlashStatus status = flashManager_.status();
    if (FlashManager::isBusyState(status.state)) {
      sendError(409, "Flash job is busy");
      return;
    }
    if (!packageStore_.restoreSavedPackage(savedPackageId, error)) {
      sendError(400, error);
      return;
    }
    if (!flashManager_.setPackageReady(error)) {
      sendError(400, error);
      return;
    }
  }

  if (!flashManager_.startFlash(error)) {
    sendError(400, error);
    return;
  }

  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = savedPackageId.isEmpty() ? "Flash job started" : "Saved firmware selected and flash job started";
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleFlashCancel() {
  flashManager_.cancel();
  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = "Cancel requested";
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::handleDeletePackage() {
  String error;
  if (!packageStore_.removePackage(error)) {
    sendError(400, error);
    return;
  }
  flashManager_.clearPackageState();

  JsonDocument doc;
  doc["ok"] = true;
  doc["message"] = "Package deleted";
  String payload;
  serializeJson(doc, payload);
  sendJson(200, payload);
}

void AppWebServer::sendJson(int statusCode, const String &payload) {
  server_->send(statusCode, "application/json", payload);
}

void AppWebServer::sendError(int statusCode, const String &message) {
  JsonDocument doc;
  doc["ok"] = false;
  doc["error"] = message;
  String payload;
  serializeJson(doc, payload);
  sendJson(statusCode, payload);
}
